website/documentation/router-confd/description.md
```mermaid
C4Container
    Container(rtpengine, "Media Proxy", "RTPEngine", "Media Proxy, based on RTPEngine")

    System_Boundary(users, "Users") {
        Person(carrier, "Carrier Trunk", "Routes inbound traffic to and terminates outbound traffic from the C5 infrastructure.")
        Person(ipbx, "IPBX", "CLASS 5 infrastructure, one or multiple PBX running CLASS 5 services.")
        Person(subscriber, "Subscriber", "Generic SIP account of the platform using the CLASS 5 services.")
    }

    System_Boundary(class4, "CLASS 4") {
        Container(sbc, "SBC", "Kamailio", "Session Board Controller, protects the C4 infrastructure from abuses, attacks and overloads.")
        Container(router, "Router", "Kamailio", "Dynamically routes the traffic based on configuration rules and settings.")
        Container(router_confd, "Router confd API", "FastAPI", "Router Configuration API, exposes a REST webservice.")
        Container(redis, "Redis Cache", "Redis", "Redis Cache for C4 components.")
        Container(postgresql, "Database", "PostgreSQL", "Relational database for C4 components.")
    }

    Rel(carrier, sbc, "SIP")
    Rel(ipbx, sbc, "SIP")
    Rel(subscriber, sbc, "SIP")
    Rel(carrier, rtpengine, "MEDIA")
    Rel(ipbx, rtpengine, "MEDIA")
    Rel(subscriber, rtpengine, "MEDIA")

    Rel(sbc, router, "SIP")
    Rel(router, router_confd, "REST")
    Rel(router_confd, postgresql, "SQL")
    Rel(router, rtpengine, "RTPEngine")

    Rel(sbc, redis, "REDIS")
    Rel(router, redis, "REDIS")
    Rel(router_confd, redis, "REDIS")
```
